Autodesk.Revit.DB.View.CanApplyColorFillScheme(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Checks if the id can be applied as the scheme id of specified category to this view.
Remarks:
The input scheme id could be InvalidElementId to clear the scheme for the specified category.
Some examples of returnning false:
The id is not a color fill scheme id.
The specified category is not supported by this view.
The category of scheme is not the same as the specified category.
The view is area plan but the scheme category is not OST_Areas,
or their Autodesk.Revit.DB.AreaScheme are not the same.
Etc.
categoryId:
The id of category.
schemeId:
The id of color fill scheme.
Returns:
True if the id can be applied as the scheme id of specified category in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.View.SetColorFillSchemeId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Applies color fill scheme to this view.
Remarks:
There could be at most three Autodesk::Revit::DB::ColorFillScheme applied in a view:
one for spatial elements (rooms, zones, spaces and areas), one for pipes and one for ducts.
Notes:
There's at most one scheme activated for all spatial categories.
For area plan view, the activated spatial scheme category must be OST_Areas and
has the same Autodesk.Revit.DB.AreaScheme  with this view if it is not used as a template.
To clear one of the above three schemes, use InvalidElementId as the parameter of this function.
To get list of element categories supportted to be colored in this view, use Autodesk.Revit.DB.View.SupportedColorFillCategoryIds.
To check whether an specified ElementId could be applied to this view, use Autodesk.Revit.DB.View.CanApplyColorFillScheme(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId).
categoryId:
The id of category to apply a color fill scheme element.
schemeId:
The id of the color fill scheme element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The schemeId can not be applied as the scheme id of categoryId in this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022